app/views/photo/index.html.erb

      <tr>
        <td><%=j + 1 %>. <%=link_to(comment.user.first_name + " " + comment.user.last_name, comment.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]